>> recursiveexpression('power')
ans = <s(<?|p^2_2>)|<<?|p^2_2>|<p^1_1|s(p^3_3)>(p^3_1,p^3_3)>(p^3_1,p^3_3)>
>> recursiveexpression('constant^2_3')
ans = <<s(s(s(?)))|p^2_2>|p^3_3>
>> evalrecfunction('constant^2_3', 2, 3)
constant²3(2,3)
<<s(s(s(?)))|p²2>|p³3>(2,3)
<<s(s(s(?)))|p²2>|p³3>(2,2)
<<s(s(s(?)))|p²2>|p³3>(2,1)
<<s(s(s(?)))|p²2>|p³3>(2,0)
<s(s(s(?)))|p²2>(2)
<s(s(s(?)))|p²2>(1)
<s(s(s(?)))|p²2>(0)
s(s(s(?)))()
s(s(?))()
s(?)()
?() = 0

s(0) = 1

s(1) = 2

s(2) = 3
p²2(0,3) = 3
p²2(1,3) = 3
p³3(2,0,3) = 3
p³3(2,1,3) = 3
p³3(2,2,3) = 3
ans =  3
>> evalrecfunction('constant^2_3', 2, 4)
constant²3(2,4)
<<s(s(s(?)))|p²2>|p³3>(2,4)
<<s(s(s(?)))|p²2>|p³3>(2,3)
<<s(s(s(?)))|p²2>|p³3>(2,2)
<<s(s(s(?)))|p²2>|p³3>(2,1)
<<s(s(s(?)))|p²2>|p³3>(2,0)
<s(s(s(?)))|p²2>(2)
<s(s(s(?)))|p²2>(1)
<s(s(s(?)))|p²2>(0)
s(s(s(?)))()
s(s(?))()
s(?)()
?() = 0

s(0) = 1

s(1) = 2

s(2) = 3
p²2(0,3) = 3
p²2(1,3) = 3
p³3(2,0,3) = 3
p³3(2,1,3) = 3
p³3(2,2,3) = 3
p³3(2,3,3) = 3
ans =  3
>> evalrecfunction('constant^2_3', 2, 5)
constant²3(2,5)
<<s(s(s(?)))|p²2>|p³3>(2,5)
<<s(s(s(?)))|p²2>|p³3>(2,4)
<<s(s(s(?)))|p²2>|p³3>(2,3)
<<s(s(s(?)))|p²2>|p³3>(2,2)
<<s(s(s(?)))|p²2>|p³3>(2,1)
<<s(s(s(?)))|p²2>|p³3>(2,0)
<s(s(s(?)))|p²2>(2)
<s(s(s(?)))|p²2>(1)
<s(s(s(?)))|p²2>(0)
s(s(s(?)))()
s(s(?))()
s(?)()
?() = 0

s(0) = 1

s(1) = 2

s(2) = 3
p²2(0,3) = 3
p²2(1,3) = 3
p³3(2,0,3) = 3
p³3(2,1,3) = 3
p³3(2,2,3) = 3
p³3(2,3,3) = 3
p³3(2,4,3) = 3
ans =  3
>> evalrecfunction('constant^2_3', 3, 3)
constant²3(3,3)
<<s(s(s(?)))|p²2>|p³3>(3,3)
<<s(s(s(?)))|p²2>|p³3>(3,2)
<<s(s(s(?)))|p²2>|p³3>(3,1)
<<s(s(s(?)))|p²2>|p³3>(3,0)
<s(s(s(?)))|p²2>(3)
<s(s(s(?)))|p²2>(2)
<s(s(s(?)))|p²2>(1)
<s(s(s(?)))|p²2>(0)
s(s(s(?)))()
s(s(?))()
s(?)()
?() = 0

s(0) = 1

s(1) = 2

s(2) = 3
p²2(0,3) = 3
p²2(1,3) = 3
p²2(2,3) = 3
p³3(3,0,3) = 3
p³3(3,1,3) = 3
p³3(3,2,3) = 3
ans =  3
>> evalrecfunction('constant^2_3', 2, 3)
constant²3(2,3)
<<s(s(s(?)))|p²2>|p³3>(2,3)
<<s(s(s(?)))|p²2>|p³3>(2,2)
<<s(s(s(?)))|p²2>|p³3>(2,1)
<<s(s(s(?)))|p²2>|p³3>(2,0)
<s(s(s(?)))|p²2>(2)
<s(s(s(?)))|p²2>(1)
<s(s(s(?)))|p²2>(0)
s(s(s(?)))()
s(s(?))()
s(?)()
?() = 0

s(0) = 1

s(1) = 2

s(2) = 3
p²2(0,3) = 3
p²2(1,3) = 3
p³3(2,0,3) = 3
p³3(2,1,3) = 3
p³3(2,2,3) = 3
ans =  3

? es sigma